#pragma once
#include <graphics.h>
#include <stdio.h>

#define SQUARE_SIZE 20

class Shape
{
public:
	Shape();
	~Shape();
	int randomshape();//随机形状的方块
	void updatepos();//更新坐标
	void change();//改变朝向
	void move(int dir);//移动方块
	void copyarr(int index);//改变朝向后调用
	struct shapearr {
		int x, y;
	}shapepos[4];//几个点的坐标
	int shapevar;//图形的种类索引
	int posx, posy;//框的坐标
	int varies[19][3][3] = {
		//z型
		{0,0,0,
		1,1,0,
		0,1,1},

		{0,0,1,
		0,1,1,
		0,1,0},

		//反向z
		{0,0,0,
		0,1,1,
		1,1,0},

		{1,0,0,
		1,1,0,
		0,1,0},

		//丨型
		{0,1,0,
		0,1,0,
		0,1,0},

		{0,0,0,
		1,1,1,
		0,0,0},

		//L型
		{0,1,0,
		0,1,0,
		0,1,1},

		{0,0,0,
		1,1,1,
		1,0,0},

		{ 1,1,0,
		0,1,0,
		0,1,0 },

		{ 0,0,1,
		1,1,1,
		0,0,0 },

		//反向L型
		{0,1,0,
		0,1,0,
		1,1,0},

		{1,0,0,
		1,1,1,
		0,0,0 },

		{0,1,1,
		0,1,0,
		0,1,0},

		{ 0,0,0,
		1,1,1,
		0,0,1 },

		//T型
		{0,1,0,
		1,1,1,
		0,0,0 },

		{0,1,0,
		0,1,1,
		0,1,0 },

		{0,0,0,
		1,1,1,
		0,1,0 },

		{0,1,0,
		1,1,0,
		0,1,0 },

		//田型
		{0,1,1,
		0,1,1,
		0,0,0}
	};//各种类型
	int nowshape[3][3];
private:
};

